#  ------------------------------------------Black Friday Data------------------------------------------

## Cleaning and preparing the data for model

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Dataset description:

A retain company "ABC Pvt Ltd" wants to understand the customer purchase behaviour(specifically purcahse amount) against various
product of different categories. They have started purchase summary of various customer for special high volume products from
last month. The data set also contains customer demographic(age, gender, maritial_status, city_type, stay_in_current_city), 
product details(product_id, product_category) and total purchase amount from last month.


Now, they want to build a model to predict the purchase amount of customer against the diff product which will help them to 
create personalized offer for a customer against diff products.

In [2]:
# Importing the dataset

df_train= pd.read_csv(r"E:\PythonPrograms\Data Sceince\8 EDA\Balck Friday\train.csv")

df_train.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969

In [3]:
df_train.shape

(550068, 12)

### So whenever you worked on kaggel dataset first combine the train and test data together so that all the preprocessing will performed on both the dataset

In [4]:
df_test= pd.read_csv(r"E:\PythonPrograms\Data Sceince\8 EDA\Balck Friday\test.csv")
df_test.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3
0,1000004,P00128942,M,46-50,7,B,2,1,1,11.0,NaN
1,1000009,P00113442,M,26-35,17,C,0,0,3,5.0,NaN
2,1000010,P00288442,F,36-45,1,B,4+,1,5,14.0,NaN
3,1000010,P00145342,F,36-45,1,B,4+,1,4,9.0,NaN
4,1000011,P00053842,F,26-35,1,C,1,0,4,5.0,12.0

In [5]:
df_test.shape

(233599, 11)

As there are 11 column bcoz dependent feature is not there so we need to combine by looking on that too

In [6]:
# Now how you will combine the dataset?

# Let's use append method

df=df_train.append(df_test)

In [7]:
df.head()

,User_ID,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,1000001,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,1000001,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,1000001,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,1000002,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [8]:
df.shape

(783667, 12)

In [9]:
# Let's see the datatypes now

df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [10]:
df.describe()

,User_ID,Occupation,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
count,7.836670e+05,783667.000000,783667.000000,783667.000000,537685.000000,237858.000000,550068.000000
mean,1.003029e+06,8.079300,0.409777,5.366196,9.844506,12.668605,9263.968713
std,1.727267e+03,6.522206,0.491793,3.878160,5.089093,4.125510,5023.065394
min,1.000001e+06,0.000000,0.000000,1.000000,2.000000,3.000000,12.000000
25%,1.001519e+06,2.000000,0.000000,1.000000,5.000000,9.000000,5823.000000
50%,1.003075e+06,7.000000,0.000000,5.000000,9.000000,14.000000,8047.000000
75%,1.004478e+06,14.000000,1.000000,8.000000,15.000000,16.000000,12054.000000
max,1.006040e+06,20.000000,1.000000,20.000000,18.000000,18.000000,23961.000000

In [11]:
df.dtypes

User_ID                         int64
Product_ID                     object
Gender                         object
Age                            object
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [12]:
# So we can userid is of no use so we can delete it.

df.drop("User_ID", axis=1, inplace=True)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 783667 entries, 0 to 233598
Data columns (total 11 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   Product_ID                  783667 non-null  object
 1   Gender                      783667 non-null  object
 2   Age                         783667 non-null  object
 3   Occupation                  783667 non-null  int64
 4   City_Category               783667 non-null  object
 5   Stay_In_Current_City_Years  783667 non-null  object
 6   Marital_Status              783667 non-null  int64
 7   Product_Category_1          783667 non-null  int64
 8   Product_Category_2          537685 non-null  float64
 9   Product_Category_3          237858 non-null  float64
 10  Purchase                    550068 non-null  float64
dtypes: float64(3), int64(3), object(5)
memory usage: 71.7+ MB

In [14]:
# Let's focus on Categorical features one by one

In [15]:
'''
Gender---- M/ F

So simpally do the one hot encoding for this

'''

pd.get_dummies(df["Gender"], drop_first=True)

        M
0       0
1       0
2       0
3       0
4       1
...    ..
233594  0
233595  0
233596  0
233597  0
233598  0

[783667 rows x 1 columns]

Male- 1

Female- 0

In [16]:
# So let's assign this to gender column

#df["Gender"]= pd.get_dummies(df["Gender"], drop_first=True)

In [17]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,F,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,F,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,F,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,F,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,M,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [18]:
# So we can do this by one more method


df['Gender']= df["Gender"].map({'M':1, 'F':0})

In [19]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,0,0-17,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,0,0-17,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,0,0-17,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,0,0-17,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,1,55+,16,C,4+,0,8,NaN,NaN,7969.0

In [20]:
'''

Now focus on Age

'''

#Let's see the unique value of age first


df.Age.unique()

array(['0-17', '55+', '26-35', '46-50', '51-55', '36-45', '18-25'],
      dtype=object)

In [21]:
# So now we can go Target Guided Encoding
# Let's give the rank


df['Age']= df['Age'].map({'0-17':1, '18-25':2, '26-35':3, '36-45':4, '46-50':5, '51-55':6, '55+':7 })

In [22]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,0,1,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,0,1,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,0,1,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,0,1,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,1,7,16,C,4+,0,8,NaN,NaN,7969.0

In [23]:
# One more way-- Let's do label encoding by library



# from sklearn.preprocessing import LabelEncoder

# LabelEncoder= LabelEncoder()

# # Now doing the encoding

# #df['Age']= LabelEncoder.fit_transform(df['Age'])

# df['Age'].unique()

In [24]:
df.dtypes

Product_ID                     object
Gender                          int64
Age                             int64
Occupation                      int64
City_Category                  object
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
dtype: object

In [25]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,P00069042,0,1,10,A,2,0,3,NaN,NaN,8370.0
1,P00248942,0,1,10,A,2,0,1,6.0,14.0,15200.0
2,P00087842,0,1,10,A,2,0,12,NaN,NaN,1422.0
3,P00085442,0,1,10,A,2,0,12,14.0,NaN,1057.0
4,P00285442,1,7,16,C,4+,0,8,NaN,NaN,7969.0

In [26]:
'''
Let's focus on city category
'''
df['City_Category'].unique()

array(['A', 'C', 'B'], dtype=object)

In [27]:
# So let's apply one hot encoding on this

temp= pd.get_dummies(df["City_Category"], drop_first=True).rename(columns={'B':'City_Category1', 'C':'City_Category2' })

In [28]:
temp

        City_Category1  City_Category2
0                    0               0
1                    0               0
2                    0               0
3                    0               0
4                    0               1
...                ...             ...
233594               1               0
233595               1               0
233596               1               0
233597               0               1
233598               1               0

[783667 rows x 2 columns]

In [29]:
# So now we need to merge this and delete city_category column

df= pd.concat([df, temp], axis=1)

In [30]:
df.head()

,Product_ID,Gender,Age,Occupation,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,P00069042,0,1,10,A,2,0,3,NaN,NaN,8370.0,0,0
1,P00248942,0,1,10,A,2,0,1,6.0,14.0,15200.0,0,0
2,P00087842,0,1,10,A,2,0,12,NaN,NaN,1422.0,0,0
3,P00085442,0,1,10,A,2,0,12,14.0,NaN,1057.0,0,0
4,P00285442,1,7,16,C,4+,0,8,NaN,NaN,7969.0,0,1

In [31]:
# Now drop original column as now we don't need that

df.drop('City_Category', axis=1, inplace=True)

In [32]:
df.head()

,Product_ID,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,P00069042,0,1,10,2,0,3,NaN,NaN,8370.0,0,0
1,P00248942,0,1,10,2,0,1,6.0,14.0,15200.0,0,0
2,P00087842,0,1,10,2,0,12,NaN,NaN,1422.0,0,0
3,P00085442,0,1,10,2,0,12,14.0,NaN,1057.0,0,0
4,P00285442,1,7,16,4+,0,8,NaN,NaN,7969.0,0,1

In [33]:
df.dtypes

Product_ID                     object
Gender                          int64
Age                             int64
Occupation                      int64
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
City_Category1                  uint8
City_Category2                  uint8
dtype: object

In [34]:
'''
Let's focus on Stay_In_Current_City_Years

'''

df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [35]:
# Let's check the missing values

df.isnull().sum()

#Don't focus on purchase null bcoz test data don't have purchase value

Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2            245982
Product_Category_3            545809
Purchase                      233599
City_Category1                     0
City_Category2                     0
dtype: int64

In [36]:
# Focus on replacing Missing Values

df['Product_Category_2'].unique()

# So this is descrete feature
# So we should use mode(not mean/median--- bcoz it can't be a diff category)

array([nan,  6., 14.,  2.,  8., 15., 16., 11.,  5.,  3.,  4., 12.,  9.,
       10., 17., 13.,  7., 18.])

In [37]:
df['Product_Category_2'].value_counts()

8.0     91317
14.0    78834
2.0     70498
16.0    61687
15.0    54114
5.0     37165
4.0     36705
6.0     23575
11.0    20230
17.0    19104
13.0    15054
9.0      8177
12.0     7801
10.0     4420
3.0      4123
18.0     4027
7.0       854
Name: Product_Category_2, dtype: int64

In [38]:
df["Product_Category_2"].mode()[0]

8.0

In [39]:
df["Product_Category_2"]= df["Product_Category_2"].fillna(df["Product_Category_2"].mode()[0])

In [40]:
#df["Product_Category_2"].value_counts()

df["Product_Category_2"].unique()

array([ 8.,  6., 14.,  2., 15., 16., 11.,  5.,  3.,  4., 12.,  9., 10.,
       17., 13.,  7., 18.])

So now no null value is here

In [41]:
# Now same for product_category3

df["Product_Category_3"].isnull().sum()

545809

In [42]:
# Let'sreplace this also

df["Product_Category_3"]= df["Product_Category_3"].fillna(df["Product_Category_3"].mode()[0])

In [43]:
df.head()

,Product_ID,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,P00069042,0,1,10,2,0,3,8.0,16.0,8370.0,0,0
1,P00248942,0,1,10,2,0,1,6.0,14.0,15200.0,0,0
2,P00087842,0,1,10,2,0,12,8.0,16.0,1422.0,0,0
3,P00085442,0,1,10,2,0,12,14.0,16.0,1057.0,0,0
4,P00285442,1,7,16,4+,0,8,8.0,16.0,7969.0,0,1

In [44]:
df.isnull().sum()

# Ignore Purcahse

Product_ID                         0
Gender                             0
Age                                0
Occupation                         0
Stay_In_Current_City_Years         0
Marital_Status                     0
Product_Category_1                 0
Product_Category_2                 0
Product_Category_3                 0
Purchase                      233599
City_Category1                     0
City_Category2                     0
dtype: int64

In [45]:
df.dtypes

Product_ID                     object
Gender                          int64
Age                             int64
Occupation                      int64
Stay_In_Current_City_Years     object
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
City_Category1                  uint8
City_Category2                  uint8
dtype: object

In [46]:
# Let's focus on stay in current city

df['Stay_In_Current_City_Years'].unique()

array(['2', '4+', '3', '1', '0'], dtype=object)

In [47]:
# As only one values is giving us this problem so let do this in a diff way

df['Stay_In_Current_City_Years']=df['Stay_In_Current_City_Years'].str.replace('+','')

c:\users\sairam\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will*not* be treated as literal strings when regex=True.
  This is separate from the ipykernel package so we can avoid doing imports until

In [48]:
df['Stay_In_Current_City_Years'].unique()

array(['2', '4', '3', '1', '0'], dtype=object)

In [49]:
# Now we convert this column into int in one go

df['Stay_In_Current_City_Years']= df['Stay_In_Current_City_Years'].astype('int64')

In [50]:
df.dtypes

Product_ID                     object
Gender                          int64
Age                             int64
Occupation                      int64
Stay_In_Current_City_Years      int64
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
City_Category1                  uint8
City_Category2                  uint8
dtype: object

In [51]:
df["City_Category1"]=df["City_Category1"].astype(int)
df["City_Category2"]=df["City_Category2"].astype(int)

In [52]:
df.dtypes

Product_ID                     object
Gender                          int64
Age                             int64
Occupation                      int64
Stay_In_Current_City_Years      int64
Marital_Status                  int64
Product_Category_1              int64
Product_Category_2            float64
Product_Category_3            float64
Purchase                      float64
City_Category1                  int32
City_Category2                  int32
dtype: object

In [53]:
# Now comee to the visualization

In [54]:
#sns.pairplot(df)

In [55]:
# Let's plot bar plot

# Age w.r.t purchase

#sns.barplot('Age', 'Purchase',data= df)

In [56]:
df.Age.unique()

array([1, 7, 3, 5, 6, 4, 2], dtype=int64)

In [57]:
# Let's divide age in subgroup of male female

#sns.barplot('Age','Purchase', hue='Gender', data=df)

So you can say maximum purchase is from male

In [58]:
df.columns

Index(['Product_ID', 'Gender', 'Age', 'Occupation',
       'Stay_In_Current_City_Years', 'Marital_Status', 'Product_Category_1',
       'Product_Category_2', 'Product_Category_3', 'Purchase',
       'City_Category1', 'City_Category2'],
      dtype='object')

In [59]:
# Visulization of purchase wrt occupation

In [60]:
#sns.barplot('Occupation', 'Purchase',hue='Gender', data=df)

In [61]:
df.Occupation.unique()

array([10, 16, 15,  7, 20,  9,  1, 12, 17,  0,  3,  4, 11,  8, 19,  2, 18,
        5, 14, 13,  6], dtype=int64)

In [62]:
# Let;s compare product_cat1 and purchase

#sns.barplot('Product_Category_1', 'Purchase', data=df)

In [63]:
#sns.barplot('Product_Category_2', 'Purchase', data=df)

So mostly people buying the 10 category

In [64]:
df.head()

#Now our data is ready

,Product_ID,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,P00069042,0,1,10,2,0,3,8.0,16.0,8370.0,0,0
1,P00248942,0,1,10,2,0,1,6.0,14.0,15200.0,0,0
2,P00087842,0,1,10,2,0,12,8.0,16.0,1422.0,0,0
3,P00085442,0,1,10,2,0,12,14.0,16.0,1057.0,0,0
4,P00285442,1,7,16,4,0,8,8.0,16.0,7969.0,0,1

In [65]:
# Let's remove the product id bcoz it's of no use

df.drop('Product_ID', axis=1, inplace=True)

In [66]:
df.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,0,1,10,2,0,3,8.0,16.0,8370.0,0,0
1,0,1,10,2,0,1,6.0,14.0,15200.0,0,0
2,0,1,10,2,0,12,8.0,16.0,1422.0,0,0
3,0,1,10,2,0,12,14.0,16.0,1057.0,0,0
4,1,7,16,4,0,8,8.0,16.0,7969.0,0,1

## Feature Scaling

In [67]:
df_test= df[df["Purchase"].isnull()]

In [68]:
df_test.shape

(233599, 11)

So test data is ready

In [69]:
df_test.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,1,5,7,2,1,1,11.0,16.0,NaN,1,0
1,1,3,17,0,0,3,5.0,16.0,NaN,0,1
2,0,4,1,4,1,5,14.0,16.0,NaN,1,0
3,0,4,1,4,1,4,9.0,16.0,NaN,1,0
4,0,3,1,1,0,4,5.0,12.0,NaN,0,1

In [70]:
df_test.drop("Purchase", axis=1, inplace=True)
df_test.shape

c:\users\sairam\appdata\local\programs\python\python37\lib\site-packages\pandas\core\frame.py:4315: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

(233599, 10)

In [71]:
# Train data

In [72]:
df_train= df[~df["Purchase"].isnull()]

In [73]:
df_train.shape

(550068, 11)

In [74]:
df_train.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,City_Category1,City_Category2
0,0,1,10,2,0,3,8.0,16.0,8370.0,0,0
1,0,1,10,2,0,1,6.0,14.0,15200.0,0,0
2,0,1,10,2,0,12,8.0,16.0,1422.0,0,0
3,0,1,10,2,0,12,14.0,16.0,1057.0,0,0
4,1,7,16,4,0,8,8.0,16.0,7969.0,0,1

In [75]:
# Seperate dependent and independent features


x= df_train.drop("Purchase", axis=1)

In [76]:
x.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,City_Category1,City_Category2
0,0,1,10,2,0,3,8.0,16.0,0,0
1,0,1,10,2,0,1,6.0,14.0,0,0
2,0,1,10,2,0,12,8.0,16.0,0,0
3,0,1,10,2,0,12,14.0,16.0,0,0
4,1,7,16,4,0,8,8.0,16.0,0,1

In [77]:
x.shape

(550068, 10)

In [78]:
# Dependent Feature

y=df_train['Purchase']

In [79]:
y.head()

0     8370.0
1    15200.0
2     1422.0
3     1057.0
4     7969.0
Name: Purchase, dtype: float64

In [80]:
y.shape

(550068,)

In [81]:
# Let's do first train,test

from sklearn.model_selection import train_test_split

x_train, x_test, y_train, y_test= train_test_split(x,y, test_size=0.33, random_state=42)

In [82]:
print(x_train.shape, y_train.shape, x_test.shape, y_test.shape)

(368545, 10) (368545,) (181523, 10) (181523,)

In [83]:
## Feature scaling

from sklearn.preprocessing import StandardScaler

sc= StandardScaler()

x_train= pd.DataFrame(sc.fit_transform(x_train), columns=x_train.columns)
x_test=  pd.DataFrame(sc.fit_transform(x_test), columns=x_test.columns)

In [84]:
x_train.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,City_Category1,City_Category2
0,0.571413,-1.105057,0.908678,0.883622,-0.834025,-1.119438,-1.690986,0.368919,1.175695,-0.672824
1,0.571413,1.847169,-1.238204,-1.442077,1.199005,0.659278,1.570200,0.368919,-0.850561,-0.672824
2,0.571413,0.371056,1.368724,-1.442077,-0.834025,-0.611233,-1.225102,-1.091830,-0.850561,1.486273
3,0.571413,-0.367001,-0.624809,-0.666844,-0.834025,0.659278,1.570200,0.368919,1.175695,-0.672824
4,-1.750048,0.371056,1.828771,0.883622,1.199005,-0.611233,-1.225102,-1.091830,1.175695,-0.672824

In [85]:
x_test.head()

,Gender,Age,Occupation,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,City_Category1,City_Category2
0,0.574918,1.854322,1.673145,0.888810,-0.830976,-1.117845,-1.690651,0.368536,-0.853172,1.490841
1,-1.739378,0.373968,0.447249,-0.663464,-0.830976,-1.117845,1.335092,0.368536,1.172097,-0.670762
2,-1.739378,0.373968,-1.238357,0.112673,1.203405,0.659797,1.335092,0.368536,-0.853172,-0.670762
3,0.574918,-1.106386,-0.625410,0.888810,-0.830976,-1.117845,1.335092,0.368536,-0.853172,-0.670762
4,0.574918,-1.106386,-0.625410,-1.439601,-0.830976,0.151900,-0.294154,0.368536,1.172097,-0.670762